using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public static class Explanation
{
    public static Dictionary<int, string> FoodExplanation = new Dictionary<int, string>()
    {
        {0, "상큼한 레몬을 갈아 만든 맛있는 과일 주스로 먹으면 갈증이 해소시킨다."},
        {1, "농장에서 생산되는 오렌지를 그대로 갈아 만든 신선한 과일 주스이다. 달콤하고 시원하다."},
        {2, "빨갛게 잘 익은 수박으로 만든 과일 주스다. 더위를 싹 날려버릴 만큼 시원하다."},

        {10, "노릇노릇하게 튀겨낸 감자튀김이다. 섬유질이 풍부해 변비에 좋다."},
        {11, "신선한 계란으로 만든 팬케이크로 돌아서면 자꾸 생각나는 맛이다."},
        {12, "닭고기를 잘 튀긴 음식으로 속은 촉촉하고 겉은 바삭하며 매우 먹음직스러운 비주얼이다."},
        {13, "햄과 계란이 듬뿍 얹어진 샌드위치로 한번 베어 물면 고소한 계란 맛에 반한다."},

        {20, "토마토가 푸짐하게 들어간 맛있는 토마토수프다. 토마토가 듬뿍 들어가 영양만점이다."},
        {21, "소고기로 만든 스테이크로 만화에서나 나올 것 같이 생겼다. 연인과 수다를 떨며 먹으면 더욱 즐겁다."},
        {22, "밀가루 반죽으로 만든 파스타이다. 뭘 먹을지 고민된다면 추천한다."},
        {23, "출출할 때 먹기 좋은 치킨 스튜이다. 국물을 떠서 한 입 먹으면 몸이 사르르 녹는다."},

        {30, "레몬, 오렌지, 수박을 접시에 가득 담은 신선한 모둠 과일이다. 맛도 만점 비타민도 만점이다."}
    };
}
